[LANGUAGE]
language=0


[CHINESE]
GUANYU_JIESHAO=Driver para Teclado Gamer V1.0 (ES)
GUANYU_BANQUAN=Redragon Argentina (2017)
MACRO_CYCLES=Cycles
RECORD_DELAY=Record Delay




UNKNOWN_KEY=Unknown key: %03x
MEDIA_PALYER_1=Media Player
MEDIA_PALY_PAUSE_2=Play/Pause
MEDIA_STOP_PALY_3=Stop
MEDIA_PREV_TRACK_4=PREV TRACK
MEDIA_Next_TRACK_5=Next
MEDIA_V_LOW_6=Volume-
MEDIA_V_ADD_7=Volume+
MEDIA_MUTE_8=Mute
MEDIA_WWW_HOME_9=Home page
MEDIA_WWW_REFRESH_10=Refresh
MEDIA_WWW_STOP_11=Stop
MEDIA_WWW_BACK_12=Back page
MEDIA_WWW_FORWARD_13=Forward page
MEDIA_WWW_FAVORITE_14=Favorites
MEDIA_WWW_SEARCH_15=Search
MEDIA_MY_PC_16=My PC
MEDIA_CALC_17=Calculator
MEDIA_MAIL_18=Email


COMPOSITE_PROMPT_CLEAR =Reset button function
COMPOSITE_PROMPT_OSK =Open on-screen keyboard
COMPOSITE_PROMPT_DEMO =The program is being used in Demo version, you cannot use more than 2 macros
COMPOSITE_MACRO_OVER =Macro size exceeds the allowed size


APPLY_PROMPT=Cannot edit in default mode
MACRO_DELETE_CONFIRM_OF_KEYS=Do you want to delete this Macro?
KEY_PROMPT=You are editing macro buttons, it is not possible to change the lighting
KEY_PROMPT_SET=Set key as:
KEY_PROMPT_SINGLE=Key(
KEY_PROMPT_MACRO=Macro(
KEY_PROMPT_MEDIA=Medium(
KEY_PROMPT_FUNCTION=Function(


MACRO_ACTION_RECORD_DELAY=Recording Delay
MACRO_NEW_PREFIX =Macro
MACRO_ERR_MAX =Maximum number of macros: %d
MACRO_ERR_SAME =Macro name already used
MACRO_ERR_NAME_SYSTEM =Macro is already in use
MACRO_DEFAULT_NAME =Empty macro
MACRO_ERR_RECORD =Stop macro recording
MACRO_PROMPT_DEMO =You use the demo version, you can't use more than 20 macros!
MACRO_KEYS_TISHI=Keys
MACRO_ACTION_TISHI=Action
MACRO_DELAY_MS= Latency (ms)

MACRO_ACTION_CLEAR_CONFIRM =Do you really want to clear the content of the macro?
MACRO_ACTION_ERR_MODIFY =Editing is not possible, use a macro to record actions
MACRO_ACTION_ERR_DELAY_MIN = Minimum latency: %d(ms)
MACRO_ACTION_ERR_DELAY_MAX = Maximum latency: %d(ms)
MACRO_ACTION_RECORD =Record
MACRO_ACTION_STOP_RECORD = Stop
MACRO_ACTION_ERR_KEYS_PROMPT =The following buttons cannot be released during macro playback
MACRO_ACTION_ERR_KEYS_PROMPT2 = \r\n Do you want to continue?
EXTRA_MACRO_TOO_LONG = Macro size exceeds what is allowed.\r\n Reduce the number of macros or actions.

DEFAULT_PROFILE_NAME =<Default profile>
PROFILE_SELECT_PROMPT =Save settings this way?
PROFILE_SEELCT_PROMPT2 =Close the dialog for quick mode
PROFILE_SELECT_PROMPT3 = Do you want to discard the changes and change the mode?
PROFILE_LOAD_PROMPT =Changing mode will automatically stop macro playback!
PROFILE_CHECK_PROMPT = Configuration file does not exist, load default configuration
PROFILE_FORMAT_ERROR = incorrect file format, change to default values: \n %s
PROFILE_NEW = New profile
PROFILE_TIP = Current profile:
PROFILE_EDITING = During editing it is not possible to change the mode.
EXTRA_PROFILE_SPACE_TIGHT = Not enough space to store the macro

MAIN_UPDATE_ERROR_TEXT=Select the correct update file
MAIN_BOOT_ERROR_TEXT=Error entering boot mode
MAIN_SHELL_ERROR_TEXT=Error updating file
MAIN_UPDATE_BACKUP_OK=Backup successful!
MAIN_UPDATE_BACKUP_NG=Failed to perform backup. Try again!

KEYBOARD_TRAY_DESC = Redragon Gamer Keyboard Software
MAIN_CAPTION = Gamer Keyboard Settings
MAIN_HELP_PROMPT = Help
MAIN_MINIMIZE_PROMPT = Minimize
MAIN_MENU_PROMPT = Menu
MAIN_CLOSE_PROMPT = Close
MAIN_BUTTON_DEARMO_VER = Driver Version V1.0 (AR)
MAIN_PROMPT_DEFAULT = Do you want to restore default settings?
MAIN_PROMPT_INPORT =File format error: import failed.
MAIN_PROMPT_DRIVER_TEXT =We detect that the driver for this keyboard is not installed. \r\nPress [OK] to start the Driver installation!
MAIN_PROMPT_DRIVER_TITLE = Keyboard Driver
MAIN_SWITCH_FUNCTION_TEXT = Switch device lighting mode
MAIN_SWITCH_COLOR_TEXT = Change key function
MAIN_DEFAULT_MATRIX_PROMPT = Failure to read the default Keyboard Layout
MAIN_NO_DEVICE_PROMPT = Compatible device not connected, please check the connection and try again

MENU_1=Import
MENU_2=Export
MENU_3=About
MENU_4=Close


MENU_11=Open(&A)
MENU_22=About(&S)
MENU_33=Close(&X)



CHINESE_5=Chinese
ENGINSH_6=Portuguese

SINGLE_STATIC=Press a Key
MACRO_NAME_SETTING=Macro Name
KEY_SETTING_TISHI=Key Settings
MACRO_EDIT_TISHI=Macro Edit

MEDIA_EDIT_TISHI=Select Media
FUNCTION_TISHI=Function key configuration

;PROFILE_1 =情景模式1
;PROFILE_2 = 情景模式2
;PROFILE_3 = 情景模式3
;PROFILE_MACRO = 宏编辑
;PROFILE_DEFAULT=恢复默认设置
;PROFILE_OK=确定
;PROFILE_CANCLE = 取消
;PROFILE_APPLY = 应用


SINGLE_KEY=Key
MACRO_SETTING=Macro Settings
MULTI_MEDIA=Multimedia
FUNCTION_KEY=Function Key
A_TOP=Upload
A_UP=Up
A_DOWN=Down
A_BOTTOM=Lower
A_RECORD=Save
A_DELETE=Delete
A_CLEAR=Clear
MACRO_OK=Ok
MACRO_CANCLE=Cancel

FUNC_KEY_DESC1=Open
FUNC_KEY_DESC2=New
FUNC_KEY_DESC3=Undo
FUNC_KEY_DESC4=Save
FUNC_KEY_DESC5=Copy
FUNC_KEY_DESC6=Cut
FUNC_KEY_DESC7=Paste
FUNC_KEY_DESC8=Search
FUNC_KEY_DESC9=Select all
FUNC_KEY_DESC10=Zoom-
FUNC_KEY_DESC11=Zoom+


[CHINESE]
GUANYU_JIESHAO=Gamming Keyboard Driver V1.0
GUANYU_BANQUAN=Copyright (C) 2016

SINGLE_STATIC=Please input a single key
MACRO_NAME_SETTING=Macro Name
KEY_SETTING_TISHI=Key Setting
MACRO_EDIT_TISHI=Macro Setting
MEDIA_EDIT_TISHI=Select a Media
FUNCTION_TISHI=Function Key Setting
PROFILE_1=Profile1
PROFILE_2=Profile2
PROFILE_3=Profile3
PROFILE_MACRO=Macro
PROFILE_DEFAULT=Restore Default
PROFILE_OK=OK
PROFILE_CANCLE=Cancel
PROFILE_APPLY=Apply
MACRO_CYCLES=Cycles
RECORD_DELAY=Record Delay
SINGLE_KEY=Single key
MACRO_SETTING=Macro setting
MULTI_MEDIA=Multimedia
FUNCTION_KEY=Function key
A_TOP=Uptop
A_UP=Up
A_DOWN=Down
A_BOTTOM=Bottom
A_RECORD=Record
A_DELETE=Delete
A_CLEAR=Clear	
MACRO_OK=OK
MACRO_CANCLE=Cancel
UNKNOWN_KEY=Unknown Key: %03x
MEDIA_PALYER_1=Media Player
MEDIA_PALY_PAUSE_2=Play/Pause
MEDIA_STOP_PALY_3=Stop Play
MEDIA_PREV_TRACK_4=Prev Track
MEDIA_Next_TRACK_5=Next Track
MEDIA_V_LOW_6=V-
MEDIA_V_ADD_7=V+
MEDIA_MUTE_8=Mute
MEDIA_WWW_HOME_9=WWW Home
MEDIA_WWW_REFRESH_10=WWW Refresh
MEDIA_WWW_STOP_11=WWW Stop
MEDIA_WWW_BACK_12=WWW Back
MEDIA_WWW_FORWARD_13=WWW Forward
MEDIA_WWW_FAVORITE_14=WWW Favorite
MEDIA_WWW_SEARCH_15=WWW Search
MEDIA_MY_PC_16=My PC
MEDIA_CALC_17=Calc
MEDIA_MAIL_18=Mail
COMPOSITE_PROMPT_CLEAR =Restore the default functiong of buttons
COMPOSITE_PROMPT_OSK =Open the on-screen keyboard
COMPOSITE_PROMPT_DEMO =Currently used is the DEMO program version
COMPOSITE_MACRO_OVER =Macro space beyond hardware store size
FUNC_KEY_DESC1=Open
FUNC_KEY_DESC2=New
FUNC_KEY_DESC3=Undo
FUNC_KEY_DESC4=Save
FUNC_KEY_DESC5=Copy
FUNC_KEY_DESC6=Cut
FUNC_KEY_DESC7=Paste
FUNC_KEY_DESC8=Find
FUNC_KEY_DESC9=Select All
FUNC_KEY_DESC10=Zoom-
FUNC_KEY_DESC11=Zoom+
APPLY_PROMPT=No Use!
MACRO_DELETE_CONFIRM_OF_KEYS=Detect some key points to set this macro, \n  really need to remove this macro?
KEY_PROMPT=No Use!
KEY_PROMPT_SET=Keys, Set:
KEY_PROMPT_SINGLE=Key(
KEY_PROMPT_MACRO=Macro(
KEY_PROMPT_MEDIA=Media(
KEY_PROMPT_FUNCTION=Function(
MACRO_ACTION_RECORD_DELAY=RecordDelay
MACRO_NEW_PREFIX =Macro
MACRO_ERR_MAX =The maximum number of macro: %d
MACRO_ERR_SAME =Same macro name!
MACRO_ERR_NAME_SYSTEM =This macro is used in the system!
MACRO_DEFAULT_NAME =Empty Macro
MACRO_ERR_RECORD =Please stop the macro record first!
MACRO_PROMPT_DEMO =Currently using a DEMO version of the program, can only play 20 times the maximum macro!
MACRO_KEYS_TISHI=Keys
MACRO_ACTION_TISHI=Action
MACRO_DELAY_MS=Delay(ms)
MACRO_ACTION_CLEAR_CONFIRM =Really need to clear the macro action?
MACRO_ACTION_ERR_MODIFY =You can not edit, use the macro record button.
MACRO_ACTION_ERR_DELAY_MIN = Minimum delay time is: %d(ms)
MACRO_ACTION_ERR_DELAY_MAX = Maximum delay time is: %d(ms)
MACRO_ACTION_RECORD =Record
MACRO_ACTION_STOP_RECORD = Stop Record
MACRO_ACTION_ERR_KEYS_PROMPT =When playing this macro is detected，the presence of the following was not eject buttons:
MACRO_ACTION_ERR_KEYS_PROMPT2 =\r\n  The need to continue? 
EXTRA_MACRO_TOO_LONG = Macro space exceeds the hardware space.\r\n Please reduce the number of macros or macro action number，and then download.
DEFAULT_PROFILE_NAME =<Default Profile>
PROFILE_SELECT_PROMPT =Whether to save the profile settings made?
PROFILE_SEELCT_PROMPT2 =When fast switch scene mode, you must first close the editor dialog box.
PROFILE_SELECT_PROMPT3 = Scene mode are editing, whether to give up the modification and change its mode?
PROFILE_LOAD_PROMPT = Switch scene mode will automatically stop the macro play!
PROFILE_CHECK_PROMPT = Scene mode file does not exist, load the default Settings!
PROFILE_FORMAT_ERROR = wrong file format, revert to the default values: \n  %s
PROFILE_NEW = \\The new contextual  mode
PROFILE_TIP = The current contextual  mode:
PROFILE_EDITING = You are editing, set not applications, can't change its mode
EXTRA_PROFILE_SPACE_TIGHT = shortage of hardware space, cancelled the macro name of storage.
MAIN_UPDATE_ERROR_TEXT=Please select the correct update file!
MAIN_BOOT_ERROR_TEXT=Unable to enter the Boot mode!
MAIN_SHELL_ERROR_TEXT=Unable to perform updating file!
MAIN_UPDATE_BACKUP_OK=备份成功!en
MAIN_UPDATE_BACKUP_NG=备份失败,请重新备份!en
KEYBOARD_TRAY_DESC = keyboard Driver
MAIN_CAPTION = Gaming Keyboard Settings
MAIN_HELP_PROMPT = Help
MAIN_MINIMIZE_PROMPT = Minimize
MAIN_MENU_PROMPT = Menu
MAIN_CLOSE_PROMPT = Close
MAIN_BUTTON_DEARMO_VER =
MAIN_PROMPT_DEFAULT = Do you want to restore the default settings?
MAIN_PROMPT_INPORT = File format error, import failed! 
MAIN_PROMPT_DRIVER_TEXT = Detects that the driver is not installed keyboard, \r\npress [OK] to start the driver installation!
MAIN_PROMPT_DRIVER_TITLE = Keyboard Driver
MAIN_SWITCH_FUNCTION_TEXT = Switch to the color keys mode
MAIN_SWITCH_COLOR_TEXT = Switch to the function keys mode
MAIN_DEFAULT_MATRIX_PROMPT = Reads the default keyboard layout failure
MAIN_NO_DEVICE_PROMPT = Device is not detected，the key settings can not be displayed!

MENU_1=Import
MENU_2=Export
MENU_3=About
MENU_4=Close
CHINESE_5=Chinese
ENGINSH_6=English

MENU_11=Open(&O)
MENU_22=About(&A)
MENU_33=Exit(&X)

